<template>
  <fieldset>
    <legend>الصرف</legend>
    <div class="input_group">
      <div class="input_field">
        <label for="Exchange">بند الصرف</label>

        <select id="Exchange" v-model="exchange">
          <option v-for="d in exchange_list" :key="d" v-text="d" :value="d" />
        </select>
      </div>

      <div class="input_field">
        <label for="the_mount">القيمه</label>
        <input id="the_mount" type="number" v-model="the_mount" />
      </div>
    </div>
  </fieldset>
</template>

<script>
export default {
  name: 'Exchange',
  data() {
    return {
      exchange: '',
      the_mount: '',
      exchange_list: [
        'سلف عمال شهر حالي',
        'مرتبات عمال شهر حالي',
        'مرتبات عمال شهور سابقه',
        'سلف إداره',
        'مرتبات إداره شهر حالي',
        'مرتبات اداره شهور سابقه',
        'إيجارات سكن العاملين',
        'ايجارات مقرات إداريه',
        'صيانة السكن (سباكه - كهرباء - أجر عمال من الخارج)',
        'مشتريات السكن (سراير - حديد - مراتب - ادوات مطبخ)',
        'تجهيز وصيانة المقرات الاداريه',
        'شراء ادوات مكتبيه',
        'شراء اثاث مكتبي وفرش',
        'شراء وصيانة أجهزه كمبيوتر ولابات وطباعة وبرامج',
        'مصروفات ومطبوعات',
        'مصروفات دعايه واعلان ومؤتمرات',
        'شراء وسائل نقل واقساطها',
        'صيانة سيارات والكاوتش',
        'إيجارات سيارات نقل عمال',
        'إنتقالات موظفين',
        'مصروفات بنزين وجاز و زيت',
        'مصروفات شراء يونيفورم للعاملين',
        'مصروفات مهمات وقايه وسفاتي',
        'فواتير إتصالات وشحن رصيد وانترنت',
        'فواتير كهرباء ومياه وغاز',
        'مصروفات شهادات صحيه وتحاليل',
        'سداد اشتراك وأقساط تأمينات إجتماعيه (حكومه)',
        'مصروفات علاج وإصابات العاملين',
        'مصروفات تأمينات خاصه (طبي وخيانه)',
        'منح ومكافئات عاملين',
        'مصروفات تراخيص ومرور',
        'مصروفات بوفيه وضيافه',
        'أقساط بنكيه',
        'سداد مصروفات ضرائب',
        'استشارات وتدريب (مكاتب خارجيه)',
        'خدمات مجتمعيه',
        'مسحوبات مصنع OMC',
        'عهدة لم تسوى',
        'مشروعات خارجيه (قطاع الإنشاءات الهندسيه والصناعيه)',
        'مسحوبات م/ هيثم حسين',
        'مصروفات شراء ماكينات',
        'مصروفات صيانة ماكينات',
        'مصروفات شراء مواد خام (قماش)',
        'مصروفات شراء اكسسوارات',
        'مصروفات مستلزمات انتاج وتغليف',
        'مصروفات تطريز وطباعه',
      ],
    }
  },
}
</script>
